def 한글함수():
    print("한글도 되는겨>")

한글함수() #컨트롤 누른 후 함수를 클릭하면 함수정의로 간다
#똑같은 방법으론 f12누르기

#컨트롤 d누르면 커서쪽 드래그
# 1. 출력문에 cls입력하면 초기화.. 지우개 역할
# 2. sen2='''안녕하세요
# 저는 손휘준입니다''' 얘는 print내에서 문자열 줄바꿈용으로 그냥 알고있으면 될듯. 출력도 그대로
# 3. 출력문에서 무한루프의 종료는 컨트롤 c

# ALT꿀팁  
# 알트누른후 방향키 업다운 누르면 코드순서변경

#컨트롤 f로 찾기후 왼쪽 화살표를 이용하면
#일괄변경가능
#컨트롤 쉬프르 f로 찾으면 해당 파일만이 아니라
#전체에 대해서 탐색가능

#들여쓰기 한꺼번에 정리 컨트롤 a 후 컨트롤 k f 누르기!
#함수정의하는 곳에서 함수 드래그 후 우클릭 - 모든참조 찾기하면
# 그 함수를 어디서 사용하고있는지 목록을 볼수 있어~
#세팅 같은곳에서 단축키 설정할수 있다는점...

# 알트 누른키로 커서 여러군데로 선택가능
#컨트롤 l 현재 줄
# \를 특수문자로 인식못하게 하는 법 : 주소앞에 r을 붙이면 (r'C:\user..')됨
# import random을 했다면 random.randint로 써야되고 form import import *하면 randint만 가능
# 코드잡고 더블클릭하면 그 단락 drop
